taurus-201-event-hubs-kafka/scripts/kafka-test.yml
modules:
  jmeter:
    path: /jmeter
    version: 5.2.1
    download-link: https://archive.apache.org/dist/jmeter/binaries/apache-jmeter-{version}.zip
    plugins:
    - jmeter.backendlistener.azure

execution:
- scenario:
    script: kafka-test.jmx
    properties:
      user.classpath: /user-jars/kafka-clients-uber-jar-0.0.1.jar
  concurrency: 5
  iterations: 2000

# Generate HTML report, see https://stackoverflow.com/questions/51955998
services:
- module: shellexec
  post-process:
  - >
    cd ${TAURUS_ARTIFACTS_DIR}
    && rm -rf report
    && cp kpi.jtl kpi.csv
    && /jmeter/bin/jmeter -Jjmeter.save.saveservice.assertion_results_failure_message=false -g kpi.csv -o report -q jmeter-bzt.properties

reporting:
- module: junit-xml
  filename: /tmp/artifacts/TEST-jmeter.xml